<?php

namespace App\Http\Controllers;

class ProductController extends Controller
{
    public function prodlist()
    {
        return [
            [
                'id' => 1,
                'name' => 'Часы 1',
                'descr' => 'Описание товара 1',
                'rating' => 5.0,
                'bought_times' => 400,
                'price' => 432.65
            ],
            [
                'id' => 2,
                'name' => 'Часы 2',
                'descr' => 'Описание товара 2',
                'rating' => 4.0,
                'bought_times' => 400,
                'price' => 4320.65
            ],
            [
                'id' => 3,
                'name' => 'Часы 3',
                'descr' => 'Описание товара 3',
                'rating' => 3.2,
                'bought_times' => 400,
                'price' => 43.65
            ],
            [
                'id' => 4,
                'name' => 'Часы 4',
                'descr' => 'Описание товара 4',
                'rating' => 4.4,
                'bought_times' => 400,
                'price' => 6632.65
            ]
        ];
    }

    public function catlist()
    {
        return ['Мобильные телефоны и аксессуары',
            'Компьютеры и офис',
            'Электроника',
            'Бытовая техника',
            'Безопасность и защита',
            'Строительство и ремонт',
            'Освещение',
            'Дом и сад',
            'Инструменты',
            'Автомобили и мотоциклы',
            'Канцтовары для офиса и дома',
            'Мебель',
            'Мужская одежда',
            'Женская одежда',
            'Обувь',
            'Детская одежда и обувь',
            'Аксессуары для одежды',
            'Украшения и аксессуары',
            'Наручные часы',
            'Багаж и сумки',
            'Спорт и развлечения',
            'Мать и ребенок',
            'Игрушки и хобби',
            'Красота и здоровье'];
    }

    public function info($id)
    {
        return [
        'id' => $id,
        'name' => 'Товар '.$id,
        'descr' => 'Описание товара '.$id,
        'rating' => 4.6,
        'bought_times' => 400,
        'price' => 10001
        ];
    }
}
